<P> <img src="https://i.ibb.co/gyNf19D/nhslogo.png" alt="nhslogo" border="0" width="100" align="right"><font size="6"><b> CS6131 Database Design</b> </font>

# Project Final Report Submission

### By Teoh Yu Xin M23605

### Submission Instructions

<div class="alert alert-block alert-info">

* You will need to submit the following files in your final project submission:
    * Your Jupyter Notebook report. Name the report `ProjectFinalReport<YourName>.ipynb`.
    * All relevant image files to be displayed in this report (make sure you use relative file referencing and the image will display in another computer).
    * Attached each file one by one and upload on Coursemology.
* Please print a copy of the final report to OneNote Individual Notebook space > Project. Double check on the image resolution. If the resolution is poor, please copy and paste the ORIGINAL clear image into the OneNote page (paste at the side of the printed image).

* Any submission that fails to comply to the above instructions will result in upto 5% penalty.

* You may wish to refer to the following reference to help organize and "beautify" your final report here. <br>
https://thecodingbot.com/markdown-in-jupyter-ipython-notebook-cheatsheet/
</div>

### Section A: Overview & Business Rules

#### Overview

<div class="alert alert-block alert-warning">
Complete your writeup of the project overview here.
</div>

Amidst the easing of COVID lockdown restrictions all around the globe, there is a sudden surge in demand for travelling. With so many vacations people desire to go for, organising the planning of these vacations is especially important to ensure that all the relevant aspects are planned for for a smooth trip. Especially for family vacations, those who plan these vacations would want a place to keep track of all the details required for the trip. They would also want the rest of their family to be informed of the trip itinerary to stay on track, even with the latest updates. Some families may also want a platform for them to share their fond memories of the trip together.

As such, a family centred holiday planning drive allows for the above functionalities to be achieved all at once. Not only is it beneficial to the people who plan, but also for the family members to all enjoy the trip together smoothly. 

In order to efficiently and structurely store vacations details, summaries, planning, sharings, a database should be used. A RDBMS system allows all of the data to be stored in a consistent manner where data type domains are kept strict to ensure the usability of the data, as well as efficient queuring and prevent data loss for the best user experience. By using a relational database, it ensures that all data updating and modifications are complete so no data is lost, consistency such that all users are able to see the same vacation details and allows all vacations to be updated simultaneously without affecting each other. Finally, it also ensures that no data is lost due to any technical faults by any single user once the data transaction is done to allow all users to use the drive without being affected.

#### Business Rules

<div class="alert alert-block alert-warning">
Complete your writeup of the final business rules here.
</div>

<p>Every&nbsp;<strong><em>USER</em></strong>&nbsp;has a&nbsp;<strong>unique user_id</strong>,&nbsp;<strong>username</strong>,&nbsp;<strong>password</strong>&nbsp;and&nbsp;<strong>email</strong>. Each user also has a setting, which comprises of two flags - whether the user&nbsp;<strong>shares their drive</strong>&nbsp;and whether they&nbsp;<strong>subscribe to emails</strong>. Each user must be under one of the three plans - basic, plus or premium plan.</p>

<p>A user <em>is in</em>&nbsp;a vacation group, where a user can be in multiple vacation groups and each vacation group contains at least one user. A user with basic plan will have a vacation group limit, where they can only be in a maximum of 5 vacation groups, therefore&nbsp;<strong>group count</strong>&nbsp;is used to keep track of the number of vacation groups. A user with either plus or premium plan can be part of an unlimited number of vacation groups. Each&nbsp;<strong><em>VACATION GROUP</em></strong>&nbsp;will have a&nbsp;<strong>unique id</strong>,&nbsp;<strong>group name</strong>&nbsp;and&nbsp;<strong>pin</strong>&nbsp;and goes for any number of vacations. A user with a plus plan will have a upgrade vacation limit, where the user can only upgrade a maximum of 5 vacations. A user with basic plan is unable to upgrade vacations, while a user with premium plan can upgrade unlimited number of vacations.</p>

<p>Each vacation group&nbsp;<em>goes for</em>&nbsp;multiple vacations. Each&nbsp;<strong><em>VACATION</em></strong>&nbsp;must have and only has one vacation group which&nbsp;<em>goes for</em>&nbsp;it (i.e. there are no individual users which go for a vacation without a vacation group, they must be under a vacation group which can consist of 1 person). Each vacation can be&nbsp;<strong>upgraded by a particular user</strong>&nbsp;or not upgraded.&nbsp;A non-upgrade vacation will only have part of the features, while an upgraded vacation can have all features. A non-upgraded vacation is unable to use the sharing function of the vacation. Once a user decides to upgrade, the upgrade cannot be reverted (i.e. if the user decides to downgrade the vacation, the upgrade count would still remain the same as the upgrade feature is counted as being used). Each vacation also has a&nbsp;<strong>unique id</strong>, a&nbsp;<strong>brief description</strong>&nbsp;of the trip,&nbsp;<strong>start</strong>&nbsp;and&nbsp;<strong>end date</strong>&nbsp;and&nbsp;<strong>budget limit</strong>&nbsp;on the trip.</p>

<p>A vacation can have multiple features - a Summary, Timeline, Planning and Sharing, but only one of each type of feature and each feature is derived or comprised of multiple entities.</p>

<p>The summary of a vacation will consist of the brief overview of the trip, made of two main components - duration and expenditure. The duration includes the start date, end date (attributes of <em><strong>VACATION</strong></em>), start country, end country and number of days for the vacation.&nbsp;The start and end country are the locations of the first and last destinations in the database, so the destination NOT NECESSARILY starts on the start date of the trip, or the end date of the trip as they may be blank on the exact starting and ending dates of the trip. The expenditure includes the budget limit (attribute of <em><strong>VACATION</strong></em>), current total expenditure and the expenditure breakdown.</p>

<p>The timeline of a vacation consists of the trip&#39;s outline by day, where each&nbsp;<strong><em>ITINERARY&nbsp;</em></strong>of the trip will be outlined. Each itinerary breakdown is identified by the unique&nbsp;<strong>day number</strong>&nbsp;and&nbsp;<strong>time</strong>&nbsp;of itinerary activity for the particular vacation (i.e. other vacations can have the same day number and timing), which consists of other details such as the&nbsp;<strong>type of itinerary</strong>&nbsp;(i.e. attraction, food, transport, etc),&nbsp;<strong>description</strong>&nbsp;and&nbsp;<strong>location</strong>. On top of the consolidated itinerary, the timeline of a vacation also consists of a breakdown of the places visited during the trip, where there are multiple&nbsp;<strong><em>DESTINATIONS</em></strong>&nbsp;for the trip. <span style="background-color:#ffff00">There is a database of destinations, with a unique unique&nbsp;</span><strong><span style="background-color:#ffff00">id,</span></strong><span style="background-color:#ffff00">&nbsp;</span><strong><span style="background-color:#ffff00">country</span></strong><span style="background-color:#ffff00">&nbsp;and&nbsp;</span><strong><span style="background-color:#ffff00">state</span></strong><span style="background-color:#ffff00">, where multiple destinations can be referenced for each vacation and each reference also includes details about&nbsp; the&nbsp;</span><strong><span style="background-color:#ffff00">number of days</span></strong><span style="background-color:#ffff00">&nbsp;spent and the&nbsp;</span><strong><span style="background-color:#ffff00">starting date</span></strong><span style="background-color:#ffff00">&nbsp;at that destination.</span></p>

<p>The planning of a vacation consists of several components - maps, booking and budget. For easier reference by the users, <span style="background-color:#ffff00">several&nbsp;</span><strong><em><span style="background-color:#ffff00">MAPS</span></em></strong><span style="background-color:#ffff00">&nbsp;can also be uploaded onto the drive. Each map has a unique&nbsp;</span><strong><span style="background-color:#ffff00">id</span></strong><span style="background-color:#ffff00">,&nbsp;</span><strong><span style="background-color:#ffff00">name</span></strong><span style="background-color:#ffff00">,&nbsp;</span><strong><span style="background-color:#ffff00">category</span></strong><span style="background-color:#ffff00">&nbsp;of map (accomodation, transport, attraction or others) and&nbsp;</span><strong><span style="background-color:#ffff00">map link attachment</span></strong><span style="background-color:#ffff00">. Maps can be&nbsp;</span><em><span style="background-color:#ffff00">referenced for</span></em><span style="background-color:#ffff00">&nbsp;multiple itineraries. </span>A vacation also includes bookings made to places of interest. Each&nbsp;<strong><em>BOOKING</em></strong>&nbsp;has a unique&nbsp;<strong>reference number</strong>&nbsp;for the particular vacation,&nbsp;<strong>type</strong>,&nbsp;<strong>description</strong>&nbsp;and&nbsp;<strong>attachment</strong>. The expenditure of the trip is also managed under planning, where the expenditure is split into&nbsp;<strong>BUDGET</strong>&nbsp;for individual components. Each budget breakdown consists of a unique&nbsp;<strong>budget id</strong>&nbsp;for the particular vacation,&nbsp;<strong>category</strong>&nbsp;of expenditure,&nbsp;<strong>expenditure</strong>&nbsp;in dollars and some&nbsp;<strong>remarks</strong>&nbsp;regarding the amount spent.</p>

<p>Finally, the sharing of a vacation involves the sharing of&nbsp;<strong><em>PHOTOS</em></strong>&nbsp;for each vacation. Each&nbsp;<strong>PHOTO</strong>&nbsp;has a unique&nbsp;<strong>id</strong>&nbsp;and corresponding&nbsp;<strong>link</strong>&nbsp;to the actual image. Several photos will fall&nbsp;<em>under</em>&nbsp;an&nbsp;<strong><em>ALBUM</em></strong>&nbsp;(for keepsake of the fond memories forged during the trip), which has a unique&nbsp;<strong>id</strong>,&nbsp;<strong>album name</strong>&nbsp;and&nbsp;<strong>album created date</strong>. A vacation&nbsp;<em>has albums</em>, and all albums must fall under a vacation. Photos that do not fall under any album are available for public viewing (i.e. all users that use the platform). When they are assigned to an album, they become private to the vacation that contains the albums.</p>

### Section B: ER Model

<div class="alert alert-block alert-warning">
Attached the image of your FINAL ER Model here.
</div>

Double click here to insert image. Any further changes from previous deliverables should be highlighted in yellow.
<img src="FINAL_ER.jpg">

### Section C: Relational Model

<div class="alert alert-block alert-warning">
Attached the image of your FINAL Relational Model here.
</div>

Double click here to insert image. Any further changes from previous deliverables should be highlighted in yellow.
<img src="FINAL_RELATIONAL_SCHEMA.jpg">

<div class="alert alert-block alert-warning">
Justify your mapping strategy from ER to relational, particularly if the approach deviates from the norm, or you have inheritance in your ER model (i.e. which strategy is adopted for inheritance mapping and why).
</div>

Strategy 8C (single relation with one type attribute) for mapping generalization and specialisation (subclass relationship) is used for faster quering and also due to only one distinct attribute for each subclass (plan type) of USER, thus the optimal strategy for faster quering and minimal data storage.

Additionally, the relationship upgrade from plus and premium user can be generalised using one arrow in the relational schema as they are distinct specialisation from the parent class user (i.e. one upg_user_id can only point to one user_id and there cannot be vacations upgraded by multiple users).

<div class="alert alert-block alert-warning">
If the relational schema mapped from the ER is not in 3NF, propose relevant normalization to make all relations in 3NF. You may leave this part blank if no further normalization is required.
</div>

Proposed normalization, if any

### Section D: DDL Schema

<div class="alert alert-block alert-warning">
Fill in the relevant code required to create the relations from your database. <br>
Your code should be end to end (i.e. I should be able to execute on my computer without much problem).
</div>

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:admin@localhost/  --make sure user is root and password is admin

In [3]:
%%sql
DROP DATABASE IF EXISTS READYHOLS;

 * mysql+mysqldb://root:***@localhost/
18 rows affected.

[]

In [4]:
%%sql
CREATE DATABASE READYHOLS;
USE READYHOLS;

CREATE TABLE user(
    user_id      char(9) not null ,
    username     varchar(30),
    password     varchar(1024),
    email        varchar(30),
    plan_type    char(10),
    sub_mail     boolean,
    share_drive  boolean,
    grp_count    integer,
    upg_count    integer,
    primary key (user_id)
);

CREATE TABLE vacation(
    vac_id       char(9) not null ,
    description  text,
    vac_grp_id   char(9),
    upg_user_id  char(9),
    start_date   date,
    end_date     date,
    budget_limit integer,
    primary key (vac_id),
    foreign key (upg_user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE vacation_grp(
    vac_grp_id   char(9) not null ,
    grp_name     varchar(50),
    vac_grp_pin  varchar(1024),
    primary key (vac_grp_id)
);

CREATE TABLE vac_user_in(
    vac_grp_id   char(9) not null,
    user_id      char(9) not null,
    primary key (vac_grp_id,user_id),
    foreign key (vac_grp_id) references vacation_grp(vac_grp_id) on update cascade on delete cascade,
    foreign key (user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE budget(
    vac_id       char(9) not null,
    budget_id    char(9) not null,
    category     varchar(30),
    expenditure  integer,
    remarks      text,
    primary key (vac_id,budget_id),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE album(
    alb_id       char(9) not null ,
    alb_name     varchar(50),
    alb_date     date,
    vac_id       char(9) not null,
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    primary key (alb_id)
);

CREATE TABLE photo(
    photo_id     char(9) not null ,
    photolink    varchar(1024),
    alb_id       char(9),
    primary key (photo_id),
    foreign key (alb_id) references album(alb_id) on update cascade on delete cascade
);

CREATE TABLE booking(
    vac_id       char(9) not null ,
    ref_no       varchar(30),
    booking_type varchar(30),
    description  text,
    attachment   varchar(1024),
    primary key (vac_id,ref_no),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE itinerary(
    vac_id       char(9) not null ,
    day_no       integer not null,
    itin_time    time not null,
    itin_type    varchar(30),
    description  varchar(100),
    location     varchar(50),
    primary key (vac_id, day_no, itin_time),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE destination(
    dest_id      char(9) not null,
    country      varchar(50),
    state        varchar(50),
    primary key (dest_id)
);

CREATE TABLE has_destination(
    vac_id       char(9) not null,
    dest_id      char(9) not null,
    no_days      integer not null,
    dstart_date  date not null,
    primary key (vac_id, dest_id, no_days, dstart_date),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    foreign key (dest_id) references destination(dest_id) on update cascade on delete cascade
);

CREATE TABLE vac_map(
    map_id       char(9) not null ,
    map_link     varchar(1024),
    name         varchar(50),
    category     varchar(30),
    primary key (map_id)
);

CREATE TABLE ref_map_itin(
    vac_id       char(9) not null ,
    itin_time    time not null,
    day_no       integer not null,
    map_id       char(9) not null,
    primary key (vac_id, day_no, itin_time, map_id),
    foreign key (vac_id, day_no, itin_time) references itinerary(vac_id, day_no, itin_time) on update cascade on delete cascade,
    foreign key (map_id) references vac_map(map_id) on update cascade on delete cascade
);


alter table vacation add foreign key(vac_grp_id) references vacation_grp(vac_grp_id) on delete cascade on update cascade;

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
grant all privileges on readyhols.* to 'root'@'localhost';
flush privileges;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
0 rows affected.

[]

### Section E: Data Population Script

<div class="alert alert-block alert-warning">
Fill in relevant code to populate data into your database. It is sufficient to have 20-50 records per table (some may have more, some less). They should be logically related and realistic. Please do not overpopulate data.
    
Note that you should use INSERT commands. If you are are using other means to populate your database, please ensure I can run the scripts easily. 
</div>

In [ ]:
%%sql

<div class="alert alert-block alert-warning">
Add in relevant select statements to show that your data is populated correctly FOR EACH relation, one cell each relation.
</div>

In [ ]:
%%sql

### Section F: Stored Program & Queries Script

<div class="alert alert-block alert-warning">
Insert your Section F from phase 2 here. No further changes required / allowed.
</div>

#### Query 1

Question: What is the summary of my vacation?

Providing a summary of a particular vacation. A summary consist of two main components - duration and expenditure. The duration includes the start date, end date, start country, end country and number of days for the vacation. The start and end country are the locations of the first and last destinations in the database, so the destination NOT NECESSARILY starts on the start_date of the trip, or the end_date of the trip as they may be blank on the exact starting and ending dates of the trip.

The expenditure includes the budget limit, current total expenditure and the expenditure breakdown. All this information is joined into one summary table.

This is relevant as it provides a good overview of the trip for users.

<p><span style="background-color:#ffff00">The query is being updated from the phase 2 code to allow for outer join such that the summary can still be displayed when no destination or expenditure component has been added to the vacation yet which can occur if the vacation has just been created.</span></p>

In [20]:
%%sql

Create view vacation_summary as

(select expenditure_summary_tbl.vac_id, start_date, end_date, first_state, first_country, last_state, last_country, 
datediff(end_date,start_date) as days, budget_limit, total_spend, remaining_budget from 

(select start_destination_tbl.vac_id, first_state, first_country, last_state, last_country from
(select vac_id,state as first_state,country as first_country from destination d1, has_destination hd1
where dstart_date <= all (select dstart_date from has_destination hd2, destination d2
where hd2.vac_id = hd1.vac_id and hd2.dest_id = d2.dest_id) and hd1.dest_id = d1.dest_id) as start_destination_tbl

join 

(select vac_id,state as last_state,country as last_country from destination d3, has_destination hd3
where dstart_date >= all (select dstart_date from has_destination hd4, destination d4 
where hd4.vac_id = hd3.vac_id and hd4.dest_id = d4.dest_id) and d3.dest_id = hd3.dest_id) as end_destination_tbl

on start_destination_tbl.vac_id = end_destination_tbl.vac_id) as destination_summary_tbl

right join  

(select start_end_vac.vac_id, start_date, end_date, days, budget_limit, total_spend, remaining_budget from
(select vac_id, start_date, end_date, datediff(end_date,start_date) as days from vacation) as start_end_vac

join

(select vac_id, budget_limit, 
case
    when total_spend is null then 0
    else total_spend
end as total_spend,

case
    when remaining_budget is null then budget_limit
    else remaining_budget
end as remaining_budget

from 
    
(select vacation_tbl.vac_id, budget_limit, total_spend, budget_limit-total_spend as remaining_budget 

from 
(select vacation.vac_id, budget_limit from vacation) as vacation_tbl

left join

(select budget.vac_id, sum(expenditure) as total_spend from budget group by budget.vac_id) as budget_tbl

on vacation_tbl.vac_id = budget_tbl.vac_id) as before_process_budget) as expense_tbl

on start_end_vac.vac_id = expense_tbl.vac_id) as expenditure_summary_tbl

on expenditure_summary_tbl.vac_id = destination_summary_tbl.vac_id)

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', datetime.date(2023, 2, 13), datetime.date(2023, 2, 16), 'Penang', 'Malaysia', 'Penang', 'Malaysia', 3, 5000, Decimal('1500'), Decimal('3500')),
 ('000000002', datetime.date(2023, 3, 29), datetime.date(2023, 4, 11), 'Tokyo', 'Japan', 'Hokkaido', 'Japan', 13, 8000, Decimal('15000'), Decimal('-7000')),
 ('000000003', datetime.date(2023, 2, 26), datetime.date(2023, 5, 10), 'Gottingen', 'Germany', 'Gottingen', 'Germany', 73, 10000, Decimal('200'), Decimal('9800')),
 ('000000004', datetime.date(2023, 6, 13), datetime.date(2023, 6, 20), 'California', 'USA', 'California', 'USA', 7, 20000, Decimal('10000'), Decimal('10000')),
 ('000000005', datetime.date(2023, 6, 2), datetime.date(2023, 6, 20), 'Bern', 'Switzerland', 'Bern', 'Switzerland', 18, 25000, Decimal('300'), Decimal('24700')),
 ('000000006', datetime.date(2023, 5, 1), datetime.date(2023, 5, 30), 'Tasmania', 'Australia', 'Tasmania', 'Australia', 29, 50000, Decimal('600'), Decimal('49400'))]

In [ ]:
%%sql
select * from vacation_summary

#### Query 2

Question: What photos are relevant to me?

Get all photos from vacations from user by first finding the vacations each user has. Additionally, all public photos are joined to the table as it is assumed that most photos will belong to albums and very little photos will be public to all users therefore minimal data wastage. Values where user_id = None is where all users can access the photo.

This is relevant as it can link all the photos relevant to vacations each user has gone for including public drive.

In [21]:
%%sql
Create view vac_user_has as
select user.user_id,vacation.vac_id from user,vacation,vac_user_in
where user.user_id = vac_user_in.user_id and vac_user_in.vac_grp_id = vacation.vac_grp_id;
select * from vac_user_has

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
19 rows affected.

[('000000002', '000000002'),
 ('000000003', '000000002'),
 ('000000005', '000000002'),
 ('000000002', '000000003'),
 ('000000001', '000000001'),
 ('000000002', '000000001'),
 ('000000001', '000000006'),
 ('000000003', '000000006'),
 ('000000006', '000000006'),
 ('000000001', '000000004'),
 ('000000002', '000000004'),
 ('000000003', '000000004'),
 ('000000004', '000000004'),
 ('000000005', '000000004'),
 ('000000001', '000000005'),
 ('000000002', '000000005'),
 ('000000003', '000000005'),
 ('000000004', '000000005'),
 ('000000005', '000000005')]

In [22]:
%%sql
Create view user_photos as

(select vac_user_has.user_id, vac_user_has.vac_id, photo.photo_id from photo, album, vac_user_has
where album.vac_id = vac_user_has.vac_id and photo.alb_id = album.alb_id)

union

#public photos_table
(select null as user_id, null as vac_id, photo_id from photo where photo.alb_id is null)

 * mysql+mysqldb://root:***@localhost/
14 rows affected.

[('000000002', '000000002', '000000001'),
 ('000000003', '000000002', '000000001'),
 ('000000005', '000000002', '000000001'),
 ('000000002', '000000002', '000000005'),
 ('000000003', '000000002', '000000005'),
 ('000000005', '000000002', '000000005'),
 ('000000002', '000000003', '000000003'),
 ('000000002', '000000003', '000000004'),
 ('000000001', '000000005', '000000002'),
 ('000000002', '000000005', '000000002'),
 ('000000003', '000000005', '000000002'),
 ('000000004', '000000005', '000000002'),
 ('000000005', '000000005', '000000002'),
 (None, None, '000000006')]

In [ ]:
%%sql
select * from user_photos

#### Query 3

Question: What am I doing for this trip?

This query displays the overall timeline of the trip by combining itinerary and destination. 

Destination is combined with itinerary by displaying the country and state the itinerary is in. This is calculated by calculating the itinerary date from the day_no from the start date of the trip and finding whether the itinerary date is within the date range of the duration of a particular destination.

In [23]:
%%sql    
select *, date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', '000000001', 4, datetime.date(2023, 2, 13), '000000001', 'Malaysia', 'Penang', datetime.date(2023, 2, 16)),
 ('000000002', '000000002', 2, datetime.date(2023, 3, 31), '000000002', 'Japan', 'Tokyo', datetime.date(2023, 4, 1)),
 ('000000002', '000000003', 3, datetime.date(2023, 4, 7), '000000003', 'Japan', 'Hokkaido', datetime.date(2023, 4, 9)),
 ('000000003', '000000004', 14, datetime.date(2023, 2, 28), '000000004', 'Germany', 'Gottingen', datetime.date(2023, 3, 13)),
 ('000000004', '000000005', 2, datetime.date(2023, 6, 15), '000000005', 'USA', 'California', datetime.date(2023, 6, 16)),
 ('000000005', '000000006', 2, datetime.date(2023, 6, 2), '000000006', 'Switzerland', 'Bern', datetime.date(2023, 6, 3)),
 ('000000006', '000000007', 10, datetime.date(2023, 5, 1), '000000007', 'Australia', 'Tasmania', datetime.date(2023, 5, 10))]

In [24]:
%%sql
Create view vacation_itinerary as

select sub_timeline_tbl.vac_id, itin_date, itin_time, itin_type, description, location, country, state, day_no from 
(select itinerary.vac_id, day_no, itin_time, itin_type, description, location,
date_add(start_date, interval (day_no-1) day) as itin_date from 

itinerary

join 

(select vac_id, start_date from vacation) as vacation_tbl

on itinerary.vac_id = vacation_tbl.vac_id) as sub_timeline_tbl

left join

(select vac_id, has_destination.dest_id, no_days, dstart_date, country, state, 
 date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id) as destination_tbl

on sub_timeline_tbl.vac_id = destination_tbl.vac_id and 
(sub_timeline_tbl.itin_date >= dstart_date and sub_timeline_tbl.itin_date <=dend_date)

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', datetime.date(2023, 2, 13), datetime.timedelta(seconds=32400), 'ATTRACTION', 'penang street', 'George Town', 'Malaysia', 'Penang'),
 ('000000001', datetime.date(2023, 2, 13), datetime.timedelta(seconds=43200), 'FOOD', 'penang street food', 'Penang Street 1', 'Malaysia', 'Penang'),
 ('000000001', datetime.date(2023, 2, 14), datetime.timedelta(seconds=28800), 'TOUR', 'malaysia heritage tour', 'Penang Street 5', 'Malaysia', 'Penang'),
 ('000000003', datetime.date(2023, 2, 26), datetime.timedelta(seconds=32400), 'FOOD', 'Christmas market food', 'Braubachstraße', None, None),
 ('000000003', datetime.date(2023, 2, 26), datetime.timedelta(seconds=39600), 'OTHERS', 'Shopping', 'Rewe Gottingen', None, None),
 ('000000005', datetime.date(2023, 6, 2), datetime.timedelta(seconds=50400), 'SIGHTSEEING', 'penang street', 'Penang Street', 'Switzerland', 'Bern'),
 ('000000005', datetime.date(2023, 6, 2), datetime.timedelta(seconds=64800), 'TOUR', 'CERN Site Tour', 'CERN', 'Switzerland', 'Bern')]

In [ ]:
%%sql
select * from vacation_itinerary

#### Additional Queries in the form of views

In [ ]:
%%sql
create view maps_itinerary_tbl as 
select vacation_itinerary.vac_id, vacation_itinerary.itin_time, vacation_itinerary.day_no, maps_tbl.map_id, map_link, description, name, category from
(select vac_id, itin_time, day_no, vac_map.map_id, map_link, name, category from 

(ref_map_itin join vac_map on vac_map.map_id = ref_map_itin.map_id)) as maps_tbl

join 

vacation_itinerary

on (vacation_itinerary.day_no = maps_tbl.day_no) and (vacation_itinerary.itin_time = maps_tbl.itin_time) 
and (vacation_itinerary.vac_id = maps_tbl.vac_id)

In [ ]:
%%sql
select * from vacation_itinerary

<div class="alert alert-block alert-warning">
<b>Triggers and Events:</b> <br>
Shortlist relevant triggers or scheduled events that are useful for your database system. 
Describe what the trigger/event is for and why it is useful for your DB.
</div>

#### Trigger/Event

#### Trigger 1

Updating user counts for upgrade when a new vacation is inserted and is upgraded. This is useful as new vacations are added quite frequently and requires updating of upgrade count for each user to ensure that they are kept within the restrictions of the user plans.

In [25]:
%%sql
create trigger insert_vacation
after insert on vacation
for each row update user 
set upg_count = upg_count + 1
where user_id = new.upg_user_id
;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [26]:
%%sql
select * from user

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', 'anna', '123456', 'anna123@nushigh.edu.sg', 'Basic', 0, 0, 3, 0),
 ('000000002', 'benny', 'abcdef', 'bennyLee@nushigh.edu.sg', 'Premium', 1, 0, 5, 2),
 ('000000003', 'charlie', '567890', 'charlieC@nushigh.edu.sg', 'Plus', 0, 1, 3, 0),
 ('000000004', 'daniel', 'DANIEL', 'dan_iel@nushigh.edu.sg', 'Plus', 0, 1, 1, 1),
 ('000000005', 'elliot', 'iLoveCS', 'elliot_@nushigh.edu.sg', 'Basic', 0, 1, 2, 0),
 ('000000006', 'francis', '567890', 'fh123@nushigh.edu.sg', 'Premium', 1, 1, 1, 1)]

In [27]:
%%sql
INSERT INTO vacation VALUES("000000007","Trip to Bangkok","000000003","000000002","2023-04-19","2023-04-23",5000);
select * from user

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
6 rows affected.

[('000000001', 'anna', '123456', 'anna123@nushigh.edu.sg', 'Basic', 0, 0, 3, 0),
 ('000000002', 'benny', 'abcdef', 'bennyLee@nushigh.edu.sg', 'Premium', 1, 0, 5, 3),
 ('000000003', 'charlie', '567890', 'charlieC@nushigh.edu.sg', 'Plus', 0, 1, 3, 0),
 ('000000004', 'daniel', 'DANIEL', 'dan_iel@nushigh.edu.sg', 'Plus', 0, 1, 1, 1),
 ('000000005', 'elliot', 'iLoveCS', 'elliot_@nushigh.edu.sg', 'Basic', 0, 1, 2, 0),
 ('000000006', 'francis', '567890', 'fh123@nushigh.edu.sg', 'Premium', 1, 1, 1, 1)]

#### Trigger 2

Updating user counts for upgrade when a vacation is updated. If the other details (other than whether the vacation is upgraded or not), the upgrade count will remain unchanged. 

If the vacation is being upgraded by another user, the original user upgrade count remains the same while the new user upgrade count increments. 

If the vacation is being upgraded (from a non-upgraded state), the new user upgrade count increases. 

This is useful as it ensures that all upgrade counts are being accounted for for each user.

In [28]:
%%sql
create trigger update_vacation
after update on vacation
for each row 
update user 
set upg_count = upg_count + 1
where (((old.upg_user_id <> new.upg_user_id) or (old.upg_user_id is null)) and (user_id = new.upg_user_id));

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [29]:
%%sql
select * from vacation

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', 'Trip to Malaysia', '000000003', None, datetime.date(2023, 2, 13), datetime.date(2023, 2, 16), 5000),
 ('000000002', 'Trip to Japan', '000000001', '000000002', datetime.date(2023, 3, 29), datetime.date(2023, 4, 11), 8000),
 ('000000003', 'Trip to Germany', '000000002', '000000002', datetime.date(2023, 2, 26), datetime.date(2023, 5, 10), 10000),
 ('000000004', 'Trip to USA', '000000005', '000000006', datetime.date(2023, 6, 13), datetime.date(2023, 6, 20), 20000),
 ('000000005', 'Trip to Switzerland', '000000005', '000000004', datetime.date(2023, 6, 2), datetime.date(2023, 6, 20), 25000),
 ('000000006', 'Trip to Australia', '000000004', None, datetime.date(2023, 5, 1), datetime.date(2023, 5, 30), 50000),
 ('000000007', 'Trip to Bangkok', '000000003', '000000002', datetime.date(2023, 4, 19), datetime.date(2023, 4, 23), 5000)]

In [30]:
%%sql
UPDATE vacation 
set budget_limit=10000 where vac_id="000000002";
select * from user

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
6 rows affected.

[('000000001', 'anna', '123456', 'anna123@nushigh.edu.sg', 'Basic', 0, 0, 3, 0),
 ('000000002', 'benny', 'abcdef', 'bennyLee@nushigh.edu.sg', 'Premium', 1, 0, 5, 3),
 ('000000003', 'charlie', '567890', 'charlieC@nushigh.edu.sg', 'Plus', 0, 1, 3, 0),
 ('000000004', 'daniel', 'DANIEL', 'dan_iel@nushigh.edu.sg', 'Plus', 0, 1, 1, 1),
 ('000000005', 'elliot', 'iLoveCS', 'elliot_@nushigh.edu.sg', 'Basic', 0, 1, 2, 0),
 ('000000006', 'francis', '567890', 'fh123@nushigh.edu.sg', 'Premium', 1, 1, 1, 1)]

In [31]:
%%sql
select * from vacation

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', 'Trip to Malaysia', '000000003', None, datetime.date(2023, 2, 13), datetime.date(2023, 2, 16), 5000),
 ('000000002', 'Trip to Japan', '000000001', '000000002', datetime.date(2023, 3, 29), datetime.date(2023, 4, 11), 10000),
 ('000000003', 'Trip to Germany', '000000002', '000000002', datetime.date(2023, 2, 26), datetime.date(2023, 5, 10), 10000),
 ('000000004', 'Trip to USA', '000000005', '000000006', datetime.date(2023, 6, 13), datetime.date(2023, 6, 20), 20000),
 ('000000005', 'Trip to Switzerland', '000000005', '000000004', datetime.date(2023, 6, 2), datetime.date(2023, 6, 20), 25000),
 ('000000006', 'Trip to Australia', '000000004', None, datetime.date(2023, 5, 1), datetime.date(2023, 5, 30), 50000),
 ('000000007', 'Trip to Bangkok', '000000003', '000000002', datetime.date(2023, 4, 19), datetime.date(2023, 4, 23), 5000)]

In [32]:
%%sql
UPDATE vacation 
set upg_user_id="000000002" where vac_id="000000006";
select * from user

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
6 rows affected.

[('000000001', 'anna', '123456', 'anna123@nushigh.edu.sg', 'Basic', 0, 0, 3, 0),
 ('000000002', 'benny', 'abcdef', 'bennyLee@nushigh.edu.sg', 'Premium', 1, 0, 5, 4),
 ('000000003', 'charlie', '567890', 'charlieC@nushigh.edu.sg', 'Plus', 0, 1, 3, 0),
 ('000000004', 'daniel', 'DANIEL', 'dan_iel@nushigh.edu.sg', 'Plus', 0, 1, 1, 1),
 ('000000005', 'elliot', 'iLoveCS', 'elliot_@nushigh.edu.sg', 'Basic', 0, 1, 2, 0),
 ('000000006', 'francis', '567890', 'fh123@nushigh.edu.sg', 'Premium', 1, 1, 1, 1)]

#### Trigger 3

Update group count when user is added to existing vacation group. This is useful to monitor the group count for each user to ensure that they still satisfy the user plan restrictions.

In [33]:
%%sql
create trigger insert_vac_grp
after insert on vac_user_in
for each row 
update user 
set grp_count = grp_count + 1
where (user_id = new.user_id);

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [34]:
%%sql
select * from user

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', 'anna', '123456', 'anna123@nushigh.edu.sg', 'Basic', 0, 0, 3, 0),
 ('000000002', 'benny', 'abcdef', 'bennyLee@nushigh.edu.sg', 'Premium', 1, 0, 5, 4),
 ('000000003', 'charlie', '567890', 'charlieC@nushigh.edu.sg', 'Plus', 0, 1, 3, 0),
 ('000000004', 'daniel', 'DANIEL', 'dan_iel@nushigh.edu.sg', 'Plus', 0, 1, 1, 1),
 ('000000005', 'elliot', 'iLoveCS', 'elliot_@nushigh.edu.sg', 'Basic', 0, 1, 2, 0),
 ('000000006', 'francis', '567890', 'fh123@nushigh.edu.sg', 'Premium', 1, 1, 1, 1)]

In [35]:
%%sql
INSERT INTO vac_user_in VALUES("000000006","000000003");
select * from user

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
6 rows affected.

[('000000001', 'anna', '123456', 'anna123@nushigh.edu.sg', 'Basic', 0, 0, 3, 0),
 ('000000002', 'benny', 'abcdef', 'bennyLee@nushigh.edu.sg', 'Premium', 1, 0, 5, 4),
 ('000000003', 'charlie', '567890', 'charlieC@nushigh.edu.sg', 'Plus', 0, 1, 4, 0),
 ('000000004', 'daniel', 'DANIEL', 'dan_iel@nushigh.edu.sg', 'Plus', 0, 1, 1, 1),
 ('000000005', 'elliot', 'iLoveCS', 'elliot_@nushigh.edu.sg', 'Basic', 0, 1, 2, 0),
 ('000000006', 'francis', '567890', 'fh123@nushigh.edu.sg', 'Premium', 1, 1, 1, 1)]

### Section G: Web UI

<div class="alert alert-block alert-warning">
<b>Instructions:</b> <br>
    
For this deliverable you will write a web application that interacts with your database to manage your domain. This application must allow the user to extract specific information from the database, through a user-friendly interface. 
 
Additional marks will be given for good webpage design (in terms of navigation, organization and functionality), and aesthetically pleasing webpage.
 
Your web interface should allow you to demonstrate the CRUD operations:<br>
    
* <b> User Info Page:</b> <br>
    - Allow user to register for a new account
    - Allow registered user to login
    - Allow logged in users to view and edit Profile / Account information
    <br>Other notes:
    - Use sessions to ensure only logged in user may access relevant information of to their account. 
    - Relevant data validation should be done.
*  <b> Search & Browse page (i.e. Read function):</b> <br>
    Upon login, users can search and browse the “data”. 
Searching is likely the most typical action for a user. The user should be presented with a form to specify their search criteria, and based on the results of the underlying database query, will be presented either a list of matching records or a single matching record if only one was found.
<br>It is not necessary to allow user to search for all tables (and they shouldn't be allowed to!). Select a few tables where the search & browse function make sense. You are advised to implement the queries shortlisted in Section F where applicable.
 
*  <b>Pages to demo Create, Update & Delete functions: </b>
   <br> Users should be able to insert, edit and delete their entries! Recommended to just focus on 2 each.
    
Note that you will need to upload ALL source code for the Web UI for this section.
    
You do not need to screen capture every page, but it should demonstrate that you have done all CRUD functions. Note that Login, Register and Profile Edit is NOT sufficient to demonstrate CRUD as it has been guided in ISSL. You should demonstrate CRUD on other tables based on shortlisted purpose of your webfrontend.
</div>

Attached relevant image of your FINAL web interface below. 

<img src="relational.jpg">

### Section H: Project Reflection

<div class="alert alert-block alert-warning">
Write a 1 page reflection here. You may reflect on the following points: <br>
    
* What insights have you gained after completing this project? 
* How has completing the project affected your view of database systems?
* How do you think this project experience would be useful to you in future?
* How do you think you have managed your time for this project? Has the help provided in class been sufficient?
</div>

Double click here to insert your writeup

<hr>
© NUS High School of Math & Science